ModifyVoucherRecharge.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:ccws="http://comverse-in.com/prepaid/ccws">
	   <soapenv:Header>
   <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsse:UsernameToken wsu:Id="UsernameToken-18097747" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>${username}</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">${password}</wsse:Password>
            <wsse:Nonce>4cipKrJU1NirIj2eSceA7g==</wsse:Nonce>
            <wsu:Created>${date}</wsu:Created>
         </wsse:UsernameToken>
      </wsse:Security>
      <ccws:VersionInfoHeader>
         <!--Optional:-->
         <ccws:ProductVersion>?</ccws:ProductVersion>
         <!--Optional:-->
         <ccws:CustomerVersion>?</ccws:CustomerVersion>
      </ccws:VersionInfoHeader>
   </soapenv:Header>
	<soapenv:Body>
		<ccws:ModifyVoucher>
			<ccws:batchNumber>${batchNumber}</ccws:batchNumber>
			<!--Optional:-->
			<ccws:newStateName>${newStateName}</ccws:newStateName>
			<ccws:startSerial>${startSerial}</ccws:startSerial>
			<ccws:endSerial>${endSerial}</ccws:endSerial>
		</ccws:ModifyVoucher>
	</soapenv:Body>
</soapenv:Envelope>